<template>
  <div class="agreement">
    <h3 class="agreement__title">Согласие на обработку персональных данных</h3>

    <div class="agreement__body">
      <h2>Согласие на обработку персональных данных</h2>

      <p>
        Настоящим физическое лицо дает свое согласие Обществу с ограниченной
        ответственностью «ГОРТОПСТРОЙ» (сокращенное наименование – ООО «ГОРТОПСТРОЙ»)
        (ОГРН: 1261800000857, ИНН: 1800046327) (далее — Оператор) на обработку
        персональных данных на интернет-сайте
        <a :href="SITE_URL" target="_blank" rel="noopener noreferrer">
         {{ SITE_URL }}
        </a>
        и его поддоменах (далее — Сайт) в соответствии с требованиями Федерального
        закона от 27.07.2006 № 152-ФЗ «О персональных данных».
      </p>

      <p>
        Давая согласие, физическое лицо подтверждает, что:
      </p>

      <ul>
        <li>действует свободно, своей волей и в своем интересе;</li>
        <li>является дееспособным;</li>
        <li>согласие является конкретным, информированным и сознательным;</li>
        <li>
          принимает условия
          <a href="/privacy" target="_blank" rel="noopener noreferrer">
            Политики конфиденциальности
          </a>
          в отношении обработки персональных данных;
        </li>
        <li>не использует чужие персональные данные при заполнении электронных форм на Сайте.</li>
      </ul>

      <ol>
        <li>
          Согласие дается на обработку персональных данных как с использованием средств
          автоматизации, так и без использования таких средств.
        </li>

        <li>
          Согласие дается на обработку следующих персональных данных:
          <ul>
            <li>фамилия, имя, отчество;</li>
            <li>номер телефона;</li>
            <li>адрес электронной почты.</li>
          </ul>
        </li>

        <li>
          Персональные данные не являются общедоступными.
        </li>

        <li>
          Оператор осуществляет связанные с обработкой персональных данных процессы в
          целях выполнения своих обязательств. Такими обязательствами Оператора
          являются:
          <ul>
            <li>предоставление субъекту персональных данных информации об оказываемых услугах;</li>
            <li>заключение, исполнение и прекращение договоров на оказание услуг.</li>
          </ul>
        </li>

        <li>
          В ходе обработки персональных данных с персональными данными будут совершены
          следующие действия: сбор, запись, систематизация, накопление, хранение,
          уточнение (обновление, изменение), электронное копирование, извлечение,
          использование, обезличивание, блокирование, удаление и уничтожение.
        </li>

        <li>
          Персональные данные обрабатываются до удаления персональных данных субъекта.
          Также обработка персональных данных может быть прекращена по запросу
          субъекта персональных данных.
        </li>

        <li>
          Согласие может быть отозвано субъектом персональных данных или его
          представителем путем направления письменного заявления Оператору по адресу
          электронной почты:
          <a :href="EMAIL_LINK">
            {{ EMAIL }}
          </a>.
        </li>

        <li>
          Согласие действует все время до момента прекращения обработки персональных
          данных, указанного в пункте 6 настоящего Согласия.
        </li>
      </ol>

    </div>

    <button
        type="button"
        class="btn btn-agry"
        @click="handleClose"
    >
      Понятно
    </button>
  </div>
</template>

<script setup>
import { useModal } from '@/composables/useModal'
import {EMAIL, SITE_URL} from "@/utils/constants.js";

const { closeModal } = useModal()

const handleClose = () => {
  closeModal()
}
</script>

<style scoped lang="scss">
.agreement {
  max-height: 70vh;
  overflow-y: auto;

  &__title {
    font-size: $font-size-2xl;
    margin-bottom: $space-16;
  }

  &__body {
    font-size: 14px;
    line-height: $line-height-normal;
    color: $color-text-soft;
    margin-bottom: $space-24;
  }
}

.btn {
  padding: $space-16;
  background-color: $color-accent;
  @include hover-btn;
  border-radius: $radius-btn;
}


</style>